app/Controllers/Histori.php

    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')
                ->with('error', 'Silakan login terlebih dahulu.');
        }

        $idUser = session()->get('id_user');

        $pesanan = $this->pesananModel
            ->where('id_user', $idUser)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `pesanan`
WHERE `id_user` = '4'
ORDER BY `created_at` DESC