app/Controllers/Home.php

    public function index()
    {
        $model = new ProdukModel();

        $data = [
            'title'  => 'Toko Sederhana Shinta',
            'produk' => $model->findAll()
        ];
---
SELECT *
FROM `produk`