app/Controllers/PesananController.php

    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }

        $pesananModel = new PesananModel();
        $pesanan = $pesananModel
            ->where('id_user', session()->get('id_user'))
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `pesanan`
WHERE `id_user` = '4'
ORDER BY `created_at` DESC

    public function detail($kode)
    {
        $pesananModel    = new PesananModel();
        $detailModel     = new DetailPesananModel();
        $pembayaranModel = new PembayaranModel();

        $pesanan = $pesananModel
            ->where('kode_pesanan', $kode)
            ->first();

        if (!$pesanan) {
            return redirect()->to('/produk')
                ->with('error', 'Pesanan tidak ditemukan.');
        }

        $detail = $detailModel
            ->where('id_pesanan', $pesanan['id_pesanan'])
            ->findAll();

        $pembayaran = $pembayaranModel
            ->where('id_pesanan', $pesanan['id_pesanan'])
            ->first();
---
SELECT *
FROM `pesanan`
WHERE `kode_pesanan` = 'ML20260920064353822'
 LIMIT 1
SELECT *
FROM `detail_pesanan`
WHERE `id_pesanan` = '7'
SELECT *
FROM `pembayaran`
WHERE `id_pesanan` = '7'
 LIMIT 1

    public function invoice($kode)
    {
        $pesananModel = new PesananModel();
        $detailModel  = new DetailPesananModel();

        $pesanan = $pesananModel
            ->where('kode_pesanan', $kode)
            ->first();

        if (!$pesanan) {
            return redirect()->to('/produk');
        }

        $detail = $detailModel
            ->where('id_pesanan', $pesanan['id_pesanan'])
            ->findAll();
---
SELECT *
FROM `pesanan`
WHERE `kode_pesanan` = 'ML20260920064353822'
 LIMIT 1
SELECT *
FROM `detail_pesanan`
WHERE `id_pesanan` = '7'