app/Controllers/Produk.php

SELECT *
FROM `produk`
---
    public function index()
    {
        $data = [
            'title'  => 'Daftar Produk',
            'produk' => $this->produkModel->findAll()
        ];